using System;

namespace IotModel
{
    public sealed partial class SysMenuBtnDAO : DbContext<SysMenuBtn>
    {
        private static SysMenuBtnDAO instance;
        public static SysMenuBtnDAO Instance
        {
            get
            {
                if (instance == null)
                {
                    instance = new SysMenuBtnDAO();
                }
                return instance;
            }
        }

        public override void Init()
        {
            try
            {
                string sql = @"
INSERT INTO sys_menu_btn VALUES ('7238808208716861445', '10010', 10, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808208716861441', '10010', 4, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808208716861442', '10010', 2, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808208716861443', '10010', 3, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808208716861444', '10010', 11, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808225443745796', '10011', 10, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808225443745793', '10011', 2, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808225443745794', '10011', 4, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808225443745795', '10011', 3, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808225443745797', '10011', 11, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7254696332256874498', '10012', 3, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7254696332256874497', '10012', 2, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7254696332256874496', '10012', 4, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7256959027433705474', '10015', 2, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7256959027433705475', '10015', 3, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7256959027433705473', '10015', 4, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238804990708420611', '10021', 3, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238804990708420610', '10021', 2, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238804990708420609', '10021', 4, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238804990708420612', '10021', 9, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238784873417150465', '10022', 4, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238784873417150466', '10022', 2, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238784873417150467', '10022', 10, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238784873417150468', '10022', 11, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238784873417150464', '10022', 3, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808256125079554', '10025', 10, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808256125079555', '10025', 3, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808256125079556', '10025', 4, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808256125079557', '10025', 2, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808256125079553', '10025', 11, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808272222818305', '10026', 4, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808272222818306', '10026', 2, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808272222818307', '10026', 3, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808272222818308', '10026', 11, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');
INSERT INTO sys_menu_btn VALUES ('7238808272222818309', '10026', 10, 0, 1, '2024-03-05 08:43:18', '开发管理员', 1, '2024-03-13 08:53:29', '开发管理员');";
                Db.Ado.ExecuteCommand(sql);
            }
            catch (Exception ex)
            {
                if (string.IsNullOrEmpty(sqlError))
                {
                    throw new Exception(ex.ToString());
                }
                else
                {
                    throw new Exception(sqlError);
                }
            }
        }

    }
}